/**
 * User: ygm
 * Date: 6/20/2016
 * Time: 7:05 PM
 */
////////////////////////////////////////////////////////////////////////////////////////////
// Prsa
////////////////////////////////////////////////////////////////////////////////////////////
 /** 常用的字符串处理 */
        /** 正则表达式 */
export var xx=6;
export  function sizeRate( rate) {
            //如果输入 100% 89em 等参数，用正则表达式
            /** reg.test(str) 用来验证字符串是否符合正则 符合返回true 否则返回false
             * reg.exec() 用来捕获符合规则的字符串
             * str.match(reg) 如果匹配成功，就返回匹配成功的数组，如果匹配不成功，就返回null
             *  当全局匹配时，match方法会一次性把符合匹配条件的字符串全部捕获到数组中
             * str.replace() 正则去匹配字符串，匹配成功的字符去替换成新的字符串
             * var str = 'a111bc222de';var res = str.replace(/\d/g,'Q');// res="aQQQbcQQQde"
             */
            return rate*3;
        }
export default {a:'a'}
